GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_fcfg1.h
// Field: [5:0] SLDO_TRIM_OUTPUT
//
// Trim value for [ANATOP_MMAP::ADI_1_SYNTH:SLDOCTL1.TRIM_OUT].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_SYNTH_DIV30_SLDO_TRIM_OUTPUT_M                 0x0000003F
#define FCFG1_CONFIG_SYNTH_DIV30_SLDO_TRIM_OUTPUT_S                 0

//*****************************************************************************
//
// Register: FCFG1_O_CONFIG_MISC_ADC_DIV5
//
//*****************************************************************************
// Field: [16:9] RSSI_OFFSET
//
// Value for RSSI measured in production test.
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_MISC_ADC_DIV5_RSSI_OFFSET_M                    0x0001FE00
#define FCFG1_CONFIG_MISC_ADC_DIV5_RSSI_OFFSET_S                    9

// Field: [8:6] QUANTCTLTHRES
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:IFADCQUANT0.TH].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_MISC_ADC_DIV5_QUANTCTLTHRES_M                  0x000001C0
#define FCFG1_CONFIG_MISC_ADC_DIV5_QUANTCTLTHRES_S                  6

// Field: [5:0] DACTRIM
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:IFADCDAC.TRIM].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_MISC_ADC_DIV5_DACTRIM_M                        0x0000003F
#define FCFG1_CONFIG_MISC_ADC_DIV5_DACTRIM_S                        0

//*****************************************************************************
//
// Register: FCFG1_O_CONFIG_MISC_ADC_DIV6
//
//*****************************************************************************
// Field: [16:9] RSSI_OFFSET
//
// Value for RSSI measured in production test.
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_MISC_ADC_DIV6_RSSI_OFFSET_M                    0x0001FE00
#define FCFG1_CONFIG_MISC_ADC_DIV6_RSSI_OFFSET_S                    9

// Field: [8:6] QUANTCTLTHRES
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:IFADCQUANT0.TH].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_MISC_ADC_DIV6_QUANTCTLTHRES_M                  0x000001C0
#define FCFG1_CONFIG_MISC_ADC_DIV6_QUANTCTLTHRES_S                  6

// Field: [5:0] DACTRIM
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:IFADCDAC.TRIM].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_MISC_ADC_DIV6_DACTRIM_M                        0x0000003F
#define FCFG1_CONFIG_MISC_ADC_DIV6_DACTRIM_S                        0

//*****************************************************************************
//
// Register: FCFG1_O_CONFIG_MISC_ADC_DIV10
//
//*****************************************************************************
// Field: [16:9] RSSI_OFFSET
//
// Value for RSSI measured in production test.
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_MISC_ADC_DIV10_RSSI_OFFSET_M                   0x0001FE00
#define FCFG1_CONFIG_MISC_ADC_DIV10_RSSI_OFFSET_S                   9

// Field: [8:6] QUANTCTLTHRES
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:IFADCQUANT0.TH].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_MISC_ADC_DIV10_QUANTCTLTHRES_M                 0x000001C0
#define FCFG1_CONFIG_MISC_ADC_DIV10_QUANTCTLTHRES_S                 6

// Field: [5:0] DACTRIM
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:IFADCDAC.TRIM].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_MISC_ADC_DIV10_DACTRIM_M                       0x0000003F
#define FCFG1_CONFIG_MISC_ADC_DIV10_DACTRIM_S                       0

//*****************************************************************************
//
// Register: FCFG1_O_CONFIG_MISC_ADC_DIV12
//
//*****************************************************************************
// Field: [16:9] RSSI_OFFSET
//
// Value for RSSI measured in production test.
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_MISC_ADC_DIV12_RSSI_OFFSET_M                   0x0001FE00
#define FCFG1_CONFIG_MISC_ADC_DIV12_RSSI_OFFSET_S                   9

// Field: [8:6] QUANTCTLTHRES
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:IFADCQUANT0.TH].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_MISC_ADC_DIV12_QUANTCTLTHRES_M                 0x000001C0
#define FCFG1_CONFIG_MISC_ADC_DIV12_QUANTCTLTHRES_S                 6

// Field: [5:0] DACTRIM
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:IFADCDAC.TRIM].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_MISC_ADC_DIV12_DACTRIM_M                       0x0000003F
#define FCFG1_CONFIG_MISC_ADC_DIV12_DACTRIM_S                       0

//*****************************************************************************
//
// Register: FCFG1_O_CONFIG_MISC_ADC_DIV15
//
//*****************************************************************************
// Field: [16:9] RSSI_OFFSET
//
// Value for RSSI measured in production test.
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_MISC_ADC_DIV15_RSSI_OFFSET_M                   0x0001FE00
#define FCFG1_CONFIG_MISC_ADC_DIV15_RSSI_OFFSET_S                   9

// Field: [8:6] QUANTCTLTHRES
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:IFADCQUANT0.TH].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_MISC_ADC_DIV15_QUANTCTLTHRES_M                 0x000001C0
#define FCFG1_CONFIG_MISC_ADC_DIV15_QUANTCTLTHRES_S                 6

// Field: [5:0] DACTRIM
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:IFADCDAC.TRIM].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_MISC_ADC_DIV15_DACTRIM_M                       0x0000003F
#define FCFG1_CONFIG_MISC_ADC_DIV15_DACTRIM_S                       0

//*****************************************************************************
//
// Register: FCFG1_O_CONFIG_MISC_ADC_DIV30
//
//*****************************************************************************
// Field: [16:9] RSSI_OFFSET
//
// Value for RSSI measured in production test.
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_MISC_ADC_DIV30_RSSI_OFFSET_M                   0x0001FE00
#define FCFG1_CONFIG_MISC_ADC_DIV30_RSSI_OFFSET_S                   9

