GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_fcfg1.h
// Field: [3]    ENABLE_SWINTF
//
// Value will be written to FLASH:CFG.ENABLE_SWINTF by boot FW while in safezone.
#define FCFG1_FLASH_OTP_DATA2_ENABLE_SWINTF                         0x00000008
#define FCFG1_FLASH_OTP_DATA2_ENABLE_SWINTF_BITN                    3
#define FCFG1_FLASH_OTP_DATA2_ENABLE_SWINTF_M                       0x00000008
#define FCFG1_FLASH_OTP_DATA2_ENABLE_SWINTF_S                       3

// Field: [2]    PROTECTCFG_N
//
// Value is inverted and written to FLASH:CFG.PROTECTCFG by boot FW while in
// safezone.
// 0: The FCFG1 area given by FLASH:PCFGSTART and FLASH:PCFGEND will be
// readprotected.
// 1: No area within the FCFG1 will be readprotected.
#define FCFG1_FLASH_OTP_DATA2_PROTECTCFG_N                          0x00000004
#define FCFG1_FLASH_OTP_DATA2_PROTECTCFG_N_BITN                     2
#define FCFG1_FLASH_OTP_DATA2_PROTECTCFG_N_M                        0x00000004
#define FCFG1_FLASH_OTP_DATA2_PROTECTCFG_N_S                        2

//*****************************************************************************
//
// Register: FCFG1_O_FLASH_OTP_DATA3
//
//*****************************************************************************
// Field: [31:23] EC_STEP_SIZE
//
// Value will be written to FLASH:FSM_STEP_SIZE.EC_STEP_SIZE by the flash device
// driver when a erase/program operation is initiated.
#define FCFG1_FLASH_OTP_DATA3_EC_STEP_SIZE_M                        0xFF800000
#define FCFG1_FLASH_OTP_DATA3_EC_STEP_SIZE_S                        23

// Field: [22]    DO_PRECOND
//
// Value will be written to FLASH:FSM_ST_MACHINE.DO_PRECOND by the flash device
// driver when a erase/program operation is initiated.
//
// Note that during a Total Erase operation the flash bank will always be erased
// with Precondition enabled independent of the value of this FCFG1 bit field.
#define FCFG1_FLASH_OTP_DATA3_DO_PRECOND                            0x00400000
#define FCFG1_FLASH_OTP_DATA3_DO_PRECOND_BITN                       22
#define FCFG1_FLASH_OTP_DATA3_DO_PRECOND_M                          0x00400000
#define FCFG1_FLASH_OTP_DATA3_DO_PRECOND_S                          22

// Field: [21:18] MAX_EC_LEVEL
//
// Value will be written to FLASH:FSM_ERA_PUL.MAX_EC_LEVEL by the flash device
// driver when a erase/program operation is initiated.
#define FCFG1_FLASH_OTP_DATA3_MAX_EC_LEVEL_M                        0x003C0000
#define FCFG1_FLASH_OTP_DATA3_MAX_EC_LEVEL_S                        18

// Field: [17:16] TRIM_1P7
//
// Value will be written to FLASH:FSEQPMP.TRIM_1P7 by the flash device driver
// when a erase/program operation is initiated.
#define FCFG1_FLASH_OTP_DATA3_TRIM_1P7_M                            0x00030000
#define FCFG1_FLASH_OTP_DATA3_TRIM_1P7_S                            16

// Field: [15:8] FLASH_SIZE
//
// Value will be written to FLASH:FLASH_SIZE.SECTORS by the boot FW while in safe
// zone.
//
// This register will be write protected by the boot FW by setting
// FLASH:CFG.CONFIGURED.
#define FCFG1_FLASH_OTP_DATA3_FLASH_SIZE_M                          0x0000FF00
#define FCFG1_FLASH_OTP_DATA3_FLASH_SIZE_S                          8

// Field: [7:0] WAIT_SYSCODE
//
// Value will be written to FLASH:WAIT_SYSCODE.WAIT_SYSCODE by boot FW code while
// in safezone.
#define FCFG1_FLASH_OTP_DATA3_WAIT_SYSCODE_M                        0x000000FF
#define FCFG1_FLASH_OTP_DATA3_WAIT_SYSCODE_S                        0

//*****************************************************************************
//
// Register: FCFG1_O_MAC_BLE_0
//
//*****************************************************************************
// Field: [31:0] ADDR_0_31
//
// The first 32-bits of the 64-bit MAC BLE address
#define FCFG1_MAC_BLE_0_ADDR_0_31_M                                 0xFFFFFFFF
#define FCFG1_MAC_BLE_0_ADDR_0_31_S                                 0

//*****************************************************************************
//
// Register: FCFG1_O_MAC_BLE_1
//
//*****************************************************************************
// Field: [31:0] ADDR_32_63
//
// The last 32-bits of the 64-bit MAC BLE address
#define FCFG1_MAC_BLE_1_ADDR_32_63_M                                0xFFFFFFFF
#define FCFG1_MAC_BLE_1_ADDR_32_63_S                                0

//*****************************************************************************
//
// Register: FCFG1_O_MAC_15_4_0
//
//*****************************************************************************
// Field: [31:0] ADDR_0_31
//
// The first 32-bits of the 64-bit MAC 15.4 address
#define FCFG1_MAC_15_4_0_ADDR_0_31_M                                0xFFFFFFFF
#define FCFG1_MAC_15_4_0_ADDR_0_31_S                                0

//*****************************************************************************
//
// Register: FCFG1_O_MAC_15_4_1
//
//*****************************************************************************
// Field: [31:0] ADDR_32_63
//
// The last 32-bits of the 64-bit MAC 15.4 address
#define FCFG1_MAC_15_4_1_ADDR_32_63_M                               0xFFFFFFFF
#define FCFG1_MAC_15_4_1_ADDR_32_63_S                               0

//*****************************************************************************
//
// Register: FCFG1_O_FLASH_OTP_DATA4
//
//*****************************************************************************
// Field: [31]    STANDBY_MODE_SEL_INT_WRT
//
// If AON_SYSCTL:PWRCTL.EXT_REG_MODE = 0, this value will be written to
// FLASH:CFG.STANDBY_MODE_SEL by flash device driver FW when a flash write
// operation is initiated.
#define FCFG1_FLASH_OTP_DATA4_STANDBY_MODE_SEL_INT_WRT              0x80000000
#define FCFG1_FLASH_OTP_DATA4_STANDBY_MODE_SEL_INT_WRT_BITN         31
#define FCFG1_FLASH_OTP_DATA4_STANDBY_MODE_SEL_INT_WRT_M            0x80000000
#define FCFG1_FLASH_OTP_DATA4_STANDBY_MODE_SEL_INT_WRT_S            31

// Field: [30:29] STANDBY_PW_SEL_INT_WRT
//
// If AON_SYSCTL:PWRCTL.EXT_REG_MODE = 0, this value will be written to
// FLASH:CFG.STANDBY_PW_SEL by flash device driver FW when a flash write operation
// is initiated.
#define FCFG1_FLASH_OTP_DATA4_STANDBY_PW_SEL_INT_WRT_M              0x60000000
#define FCFG1_FLASH_OTP_DATA4_STANDBY_PW_SEL_INT_WRT_S              29

// Field: [28]    DIS_STANDBY_INT_WRT
//
// If AON_SYSCTL:PWRCTL.EXT_REG_MODE = 0, this value will be written to
// FLASH:CFG.DIS_STANDBY by flash device driver FW when a flash write operation is
// initiated.
#define FCFG1_FLASH_OTP_DATA4_DIS_STANDBY_INT_WRT                   0x10000000
#define FCFG1_FLASH_OTP_DATA4_DIS_STANDBY_INT_WRT_BITN              28
#define FCFG1_FLASH_OTP_DATA4_DIS_STANDBY_INT_WRT_M                 0x10000000
#define FCFG1_FLASH_OTP_DATA4_DIS_STANDBY_INT_WRT_S                 28

// Field: [27]    DIS_IDLE_INT_WRT
//
// If AON_SYSCTL:PWRCTL.EXT_REG_MODE = 0, this value will be written to
// FLASH:CFG.DIS_IDLE by flash device driver FW when a flash write operation is
// initiated.
#define FCFG1_FLASH_OTP_DATA4_DIS_IDLE_INT_WRT                      0x08000000
#define FCFG1_FLASH_OTP_DATA4_DIS_IDLE_INT_WRT_BITN                 27
#define FCFG1_FLASH_OTP_DATA4_DIS_IDLE_INT_WRT_M                    0x08000000
#define FCFG1_FLASH_OTP_DATA4_DIS_IDLE_INT_WRT_S                    27

