GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_fcfg1.h
// Field: [9:6] IBIASCAP_LPTOHP_OL_CNT
//
// During XOSC mode transition, CAP trim and IBIAS trim should be modified by this
// amount. IBIAS and CAP trim open loop count. CAP_REM is remainder of the CAP that
// is left to reach the final cap value.
#define FCFG1_AMPCOMP_TH1_IBIASCAP_LPTOHP_OL_CNT_M                  0x000003C0
#define FCFG1_AMPCOMP_TH1_IBIASCAP_LPTOHP_OL_CNT_S                  6

// Field: [5:0] HPMRAMP1_TH
//
// During XOSC mode transition, CAP trim and IBIAS trim should be modified by this
// amount. IBIAS and CAP trim open loop count. CAP_REM is remainder of the CAP that
// is left to reach the final cap value.
#define FCFG1_AMPCOMP_TH1_HPMRAMP1_TH_M                             0x0000003F
#define FCFG1_AMPCOMP_TH1_HPMRAMP1_TH_S                             0

//*****************************************************************************
//
// Register: FCFG1_O_AMPCOMP_TH2
//
//*****************************************************************************
// Field: [31:26] LPMUPDATE_LTH
//
// LPM Update low amplitude threshhold.
// if amp > LPMUPDATE_LTH && amp < LPMUPDATE_HTH then move on.
#define FCFG1_AMPCOMP_TH2_LPMUPDATE_LTH_M                           0xFC000000
#define FCFG1_AMPCOMP_TH2_LPMUPDATE_LTH_S                           26

// Field: [23:18] LPMUPDATE_HTM
//
// LPM Update high amplitude threshhold.
// if amp > LPMUPDATE_LTH && amp < LPMUPDATE_HTH then move on.
#define FCFG1_AMPCOMP_TH2_LPMUPDATE_HTM_M                           0x00FC0000
#define FCFG1_AMPCOMP_TH2_LPMUPDATE_HTM_S                           18

// Field: [15:10] ADC_COMP_AMPTH_LPM
//
// When ADC is forced in comparator mode, this value is used as OPAMP's threshold
// during LPM_UPDATE mode. Actual amplitude is compared against this threshhold to
// generate 1-bit adc_threshholdmet indicator output.
#define FCFG1_AMPCOMP_TH2_ADC_COMP_AMPTH_LPM_M                      0x0000FC00
#define FCFG1_AMPCOMP_TH2_ADC_COMP_AMPTH_LPM_S                      10

// Field: [7:2] ADC_COMP_AMPTH_HPM
//
// When ADC is forced in comparator mode, this value is used as OPAMP's threshold
// during HPM_UPDATE mode. Actual amplitude is compared against this threshhold to
// generate 1-bit adc_threshholdmet indicator output.
#define FCFG1_AMPCOMP_TH2_ADC_COMP_AMPTH_HPM_M                      0x000000FC
#define FCFG1_AMPCOMP_TH2_ADC_COMP_AMPTH_HPM_S                      2

//*****************************************************************************
//
// Register: FCFG1_O_AMPCOMP_CTRL1
//
//*****************************************************************************
// Field: [30]    AMPCOMP_REQ_MODE
//
// Trim value for [ANATOP_MMAP::DDI_0_OSC:AMPCOMPCTL.AMPCOMP_REQ_MODE].
#define FCFG1_AMPCOMP_CTRL1_AMPCOMP_REQ_MODE                        0x40000000
#define FCFG1_AMPCOMP_CTRL1_AMPCOMP_REQ_MODE_BITN                   30
#define FCFG1_AMPCOMP_CTRL1_AMPCOMP_REQ_MODE_M                      0x40000000
#define FCFG1_AMPCOMP_CTRL1_AMPCOMP_REQ_MODE_S                      30

// Field: [23:20] IBIAS_OFFSET
//
// Offset values of XOSC IBIAS trim. IBIAS trim value would always be greater than
// or equal to this offset in both HPM and LPM.
#define FCFG1_AMPCOMP_CTRL1_IBIAS_OFFSET_M                          0x00F00000
#define FCFG1_AMPCOMP_CTRL1_IBIAS_OFFSET_S                          20

// Field: [19:16] IBIAS_INIT
//
// Initial value of XOSC IBIAS trim. During ramping up, IBIAS is set to
// IBIAS_OFFSET + IBIAS_INIT.
#define FCFG1_AMPCOMP_CTRL1_IBIAS_INIT_M                            0x000F0000
#define FCFG1_AMPCOMP_CTRL1_IBIAS_INIT_S                            16

// Field: [15:8] LPM_IBIAS_WAIT_CNT_FINAL
//
// FSM waits for ddi_lpm_ibias_wait_cnt_final clock cycles in
// IDAC_DECREMENT_WITH_MEASURE states in order to compensate slow response of the
// xtal. 8-bits.
#define FCFG1_AMPCOMP_CTRL1_LPM_IBIAS_WAIT_CNT_FINAL_M              0x0000FF00
#define FCFG1_AMPCOMP_CTRL1_LPM_IBIAS_WAIT_CNT_FINAL_S              8

// Field: [7:4] CAP_STEP
//
// Step size of XOSC CAP trim (both Q1 and Q2) during XOSC mode transition. Can
// vary from 6 to 12. Other values are possible but not valid.
#define FCFG1_AMPCOMP_CTRL1_CAP_STEP_M                              0x000000F0
#define FCFG1_AMPCOMP_CTRL1_CAP_STEP_S                              4

// Field: [3:0] IBIASCAP_HPTOLP_OL_CNT
//
// During HPM to LPM transition, CAP trim and IBIAS trim should be modified by this
// amount. IBIAS and CAP trim open loop count. CAP_REM is remainder of the CAP that
// is left to reach the final cap value. Do not need to program this.
// CAP_TRIM = CAP_INIT - CAP_STEP*IBIASCAP_HPTOLP_OL_CNT - CAP_REM;
// IBIAS_TRIM = IBIAS_INIT - 1*IBIASCAP_HPTOLP_OL_CNT;
// Here, cap_init is decimal conversion of cap_init_col and cap_init_row.
#define FCFG1_AMPCOMP_CTRL1_IBIASCAP_HPTOLP_OL_CNT_M                0x0000000F
#define FCFG1_AMPCOMP_CTRL1_IBIASCAP_HPTOLP_OL_CNT_S                0

//*****************************************************************************
//
// Register: FCFG1_O_ANABYPASS_VALUE2
//
//*****************************************************************************
// Field: [13:0] XOSC_HF_IBIASTHERM
//
// Value of xosc_hf_ibiastherm when oscdig is bypassed.
//
#define FCFG1_ANABYPASS_VALUE2_XOSC_HF_IBIASTHERM_M                 0x00003FFF
#define FCFG1_ANABYPASS_VALUE2_XOSC_HF_IBIASTHERM_S                 0

//*****************************************************************************
//
// Register: FCFG1_O_CONFIG_MISC_ADC
//
//*****************************************************************************
// Field: [17]    RSSITRIMCOMPLETE_N
//
// Status of RSSI trim
// 0: Trimmed
// 1: Not trimmed
#define FCFG1_CONFIG_MISC_ADC_RSSITRIMCOMPLETE_N                    0x00020000
#define FCFG1_CONFIG_MISC_ADC_RSSITRIMCOMPLETE_N_BITN               17
#define FCFG1_CONFIG_MISC_ADC_RSSITRIMCOMPLETE_N_M                  0x00020000
#define FCFG1_CONFIG_MISC_ADC_RSSITRIMCOMPLETE_N_S                  17

