GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_fcfg1.h
// Field: [16:9] RSSI_OFFSET
//
// Value for RSSI measured in production test.
// Value is read by RF Core ROM FW during RF Core initialization.
#define FCFG1_CONFIG_MISC_ADC_RSSI_OFFSET_M                         0x0001FE00
#define FCFG1_CONFIG_MISC_ADC_RSSI_OFFSET_S                         9

// Field: [8:6] QUANTCTLTHRES
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:IFADCQUANT0.TH].
// Value is read by RF Core ROM FW during RF Core initialization.
#define FCFG1_CONFIG_MISC_ADC_QUANTCTLTHRES_M                       0x000001C0
#define FCFG1_CONFIG_MISC_ADC_QUANTCTLTHRES_S                       6

// Field: [5:0] DACTRIM
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:IFADCDAC.TRIM].
// Value is read by RF Core ROM FW during RF Core initialization.
#define FCFG1_CONFIG_MISC_ADC_DACTRIM_M                             0x0000003F
#define FCFG1_CONFIG_MISC_ADC_DACTRIM_S                             0

//*****************************************************************************
//
// Register: FCFG1_O_TEST_TEMPS
//
//*****************************************************************************
// Field: [31:24] TEST_TEMP4
//
// Temperature for the 4. test insertion.
// Valid values -40C to 125C. 0xFF means not (yet) run.
#define FCFG1_TEST_TEMPS_TEST_TEMP4_M                               0xFF000000
#define FCFG1_TEST_TEMPS_TEST_TEMP4_S                               24

// Field: [23:16] TEST_TEMP3
//
// Temperature for the 3. test insertion.
// Valid values -40C to 125C. 0xFF means not (yet) run.
#define FCFG1_TEST_TEMPS_TEST_TEMP3_M                               0x00FF0000
#define FCFG1_TEST_TEMPS_TEST_TEMP3_S                               16

// Field: [15:8] TEST_TEMP2
//
// Temperature for the 2. test insertion.
// Valid values -40C to 125C. 0xFF means not (yet) run.
#define FCFG1_TEST_TEMPS_TEST_TEMP2_M                               0x0000FF00
#define FCFG1_TEST_TEMPS_TEST_TEMP2_S                               8

// Field: [7:0] TEST_TEMP1
//
// Temperature for the 1. test insertion.
// Valid values -40C to 125C. 0xFF means not (yet) run.
#define FCFG1_TEST_TEMPS_TEST_TEMP1_M                               0x000000FF
#define FCFG1_TEST_TEMPS_TEST_TEMP1_S                               0

//*****************************************************************************
//
// Register: FCFG1_O_VOLT_TRIM
//
//*****************************************************************************
// Field: [28:24] VDDR_TRIM_HH
//
// TBD: Trim value for 1.94V VDDR found in production test (for CC13xx high PA
// output power only).
#define FCFG1_VOLT_TRIM_VDDR_TRIM_HH_M                              0x1F000000
#define FCFG1_VOLT_TRIM_VDDR_TRIM_HH_S                              24

// Field: [20:16] VDDR_TRIM_H
//
// Trim value for 1.85V VDDR found in production test (for external VDDR load mode)
#define FCFG1_VOLT_TRIM_VDDR_TRIM_H_M                               0x001F0000
#define FCFG1_VOLT_TRIM_VDDR_TRIM_H_S                               16

// Field: [12:8] VDDR_TRIM_SLEEP_H
//
// Trim value for 1.75V VDDR recharge target found in production test (for external
// VDDR load mode).
#define FCFG1_VOLT_TRIM_VDDR_TRIM_SLEEP_H_M                         0x00001F00
#define FCFG1_VOLT_TRIM_VDDR_TRIM_SLEEP_H_S                         8

// Field: [4:0] TRIMBOD_H
//
// Trim value for 2.0V VDDS BOD target found in production test.
// To be applied to [ANATOP_MMAP::ADI_3_REFSYS:REFSYSCTL1.TRIM_VDDS_BOD] when
// 2.0V BOD is needed?
#define FCFG1_VOLT_TRIM_TRIMBOD_H_M                                 0x0000001F
#define FCFG1_VOLT_TRIM_TRIMBOD_H_S                                 0

//*****************************************************************************
//
// Register: FCFG1_O_OSC_CONF
//
//*****************************************************************************
// Field: [29]    ADC_SH_VBUF_EN
//
// Trim value for [ANATOP_MMAP::DDI_0_OSC:ADCDOUBLERNANOAMPCTL.ADC_SH_VBUF_EN].
#define FCFG1_OSC_CONF_ADC_SH_VBUF_EN                               0x20000000
#define FCFG1_OSC_CONF_ADC_SH_VBUF_EN_BITN                          29
#define FCFG1_OSC_CONF_ADC_SH_VBUF_EN_M                             0x20000000
#define FCFG1_OSC_CONF_ADC_SH_VBUF_EN_S                             29

// Field: [28]    ADC_SH_MODE_EN
//
// Trim value for [ANATOP_MMAP::DDI_0_OSC:ADCDOUBLERNANOAMPCTL.ADC_SH_MODE_EN].
#define FCFG1_OSC_CONF_ADC_SH_MODE_EN                               0x10000000
#define FCFG1_OSC_CONF_ADC_SH_MODE_EN_BITN                          28
#define FCFG1_OSC_CONF_ADC_SH_MODE_EN_M                             0x10000000
#define FCFG1_OSC_CONF_ADC_SH_MODE_EN_S                             28

// Field: [27]    ATESTLF_RCOSCLF_IBIAS_TRIM
//
// Trim value for [ANATOP_MMAP::DDI_0_OSC:ATESTCTL.ATESTLF_RCOSCLF_IBIAS_TRIM].
#define FCFG1_OSC_CONF_ATESTLF_RCOSCLF_IBIAS_TRIM                   0x08000000
#define FCFG1_OSC_CONF_ATESTLF_RCOSCLF_IBIAS_TRIM_BITN              27
#define FCFG1_OSC_CONF_ATESTLF_RCOSCLF_IBIAS_TRIM_M                 0x08000000
#define FCFG1_OSC_CONF_ATESTLF_RCOSCLF_IBIAS_TRIM_S                 27

// Field: [26:25] XOSCLF_REGULATOR_TRIM
//
// Trim value for [ANATOP_MMAP::DDI_0_OSC:LFOSCCTL.XOSCLF_REGULATOR_TRIM].
#define FCFG1_OSC_CONF_XOSCLF_REGULATOR_TRIM_M                      0x06000000
#define FCFG1_OSC_CONF_XOSCLF_REGULATOR_TRIM_S                      25

// Field: [24:21] XOSCLF_CMIRRWR_RATIO
//
// Trim value for [ANATOP_MMAP::DDI_0_OSC:LFOSCCTL.XOSCLF_CMIRRWR_RATIO].
#define FCFG1_OSC_CONF_XOSCLF_CMIRRWR_RATIO_M                       0x01E00000
#define FCFG1_OSC_CONF_XOSCLF_CMIRRWR_RATIO_S                       21

// Field: [20:19] XOSC_HF_FAST_START
//
// Trim value for [ANATOP_MMAP::DDI_0_OSC:CTL1.XOSC_HF_FAST_START].
// This trim value is not relevant for PG1 devices.
#define FCFG1_OSC_CONF_XOSC_HF_FAST_START_M                         0x00180000
#define FCFG1_OSC_CONF_XOSC_HF_FAST_START_S                         19

// Field: [18]    XOSC_OPTION
//
// 0: XOSC_HF unavailable (may not be bonded out)
// 1: XOSC_HF available (default)
#define FCFG1_OSC_CONF_XOSC_OPTION                                  0x00040000
#define FCFG1_OSC_CONF_XOSC_OPTION_BITN                             18
#define FCFG1_OSC_CONF_XOSC_OPTION_M                                0x00040000
#define FCFG1_OSC_CONF_XOSC_OPTION_S                                18

