GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_fcfg1.h
// Field: [17]    BAW_OPTION
//
// 0: BAW available
// 1: BAW unavailable (default)
#define FCFG1_OSC_CONF_BAW_OPTION                                   0x00020000
#define FCFG1_OSC_CONF_BAW_OPTION_BITN                              17
#define FCFG1_OSC_CONF_BAW_OPTION_M                                 0x00020000
#define FCFG1_OSC_CONF_BAW_OPTION_S                                 17

// Field: [16]    BAW_FREQ
//
// 0: 840MHz
// 1: 2520MHz (default)
#define FCFG1_OSC_CONF_BAW_FREQ                                     0x00010000
#define FCFG1_OSC_CONF_BAW_FREQ_BITN                                16
#define FCFG1_OSC_CONF_BAW_FREQ_M                                   0x00010000
#define FCFG1_OSC_CONF_BAW_FREQ_S                                   16

// Field: [15:0] BAW_TRIM
//
// (TBD contents for now, trimmed in production test for BAW devices
#define FCFG1_OSC_CONF_BAW_TRIM_M                                   0x0000FFFF
#define FCFG1_OSC_CONF_BAW_TRIM_S                                   0

//*****************************************************************************
//
// Register: FCFG1_O_FREQ_OFFSET
//
//*****************************************************************************
// Field: [31:16] BAW_COMP_P0
//
// Signed 16-bit value, representing the frequency offset at 27 degrees C.
#define FCFG1_FREQ_OFFSET_BAW_COMP_P0_M                             0xFFFF0000
#define FCFG1_FREQ_OFFSET_BAW_COMP_P0_S                             16

// Field: [15:8] BAW_COMP_P1
//
// Signed 8-bit value, representing the first order frequency offset slope.
#define FCFG1_FREQ_OFFSET_BAW_COMP_P1_M                             0x0000FF00
#define FCFG1_FREQ_OFFSET_BAW_COMP_P1_S                             8

// Field: [7:0] BAW_COMP_P2
//
// Signed 8-bit value, representing the second order frequency offset slope. The
// actual frequency of the clock would be defined as 48MHz*(1+d), where = P0*2^(-22)
// + P1*(T-27)*2^(-25) + P2*(T-27)^2*2^(-31).
#define FCFG1_FREQ_OFFSET_BAW_COMP_P2_M                             0x000000FF
#define FCFG1_FREQ_OFFSET_BAW_COMP_P2_S                             0

//*****************************************************************************
//
// Register: FCFG1_O_CAP_TRIM
//
//*****************************************************************************
// Field: [31:16] FLUX_CAP_0P28_TRIM
//
// Reserved storage of measurement value on 0.28um pitch FLUX CAP (measured in
// production test)
#define FCFG1_CAP_TRIM_FLUX_CAP_0P28_TRIM_M                         0xFFFF0000
#define FCFG1_CAP_TRIM_FLUX_CAP_0P28_TRIM_S                         16

// Field: [15:0] FLUX_CAP_0P4_TRIM
//
// Reserved storage of measurement value on 0.4um pitch FLUX CAP (measured in
// production test)
#define FCFG1_CAP_TRIM_FLUX_CAP_0P4_TRIM_M                          0x0000FFFF
#define FCFG1_CAP_TRIM_FLUX_CAP_0P4_TRIM_S                          0

//*****************************************************************************
//
// Register: FCFG1_O_MISC_OTP_DATA_1
//
//*****************************************************************************
// Field: [28:27] PEAK_DET_ITRIM
//
// Trim value for [ANATOP_MMAP::DDI_0_OSC:XOSCHFCTL.PEAK_DET_ITRIM].
#define FCFG1_MISC_OTP_DATA_1_PEAK_DET_ITRIM_M                      0x18000000
#define FCFG1_MISC_OTP_DATA_1_PEAK_DET_ITRIM_S                      27

// Field: [26:24] HP_BUF_ITRIM
//
// Trim value for [ANATOP_MMAP::DDI_0_OSC:XOSCHFCTL.HP_BUF_ITRIM].
#define FCFG1_MISC_OTP_DATA_1_HP_BUF_ITRIM_M                        0x07000000
#define FCFG1_MISC_OTP_DATA_1_HP_BUF_ITRIM_S                        24

// Field: [23:22] LP_BUF_ITRIM
//
// Trim value for [ANATOP_MMAP::DDI_0_OSC:XOSCHFCTL.LP_BUF_ITRIM].
#define FCFG1_MISC_OTP_DATA_1_LP_BUF_ITRIM_M                        0x00C00000
#define FCFG1_MISC_OTP_DATA_1_LP_BUF_ITRIM_S                        22

// Field: [21:20] DBLR_LOOP_FILTER_RESET_VOLTAGE
//
// Trim value for
// [ANATOP_MMAP::DDI_0_OSC:ADCDOUBLERNANOAMPCTL.DBLR_LOOP_FILTER_RESET_VOLTAGE].
#define FCFG1_MISC_OTP_DATA_1_DBLR_LOOP_FILTER_RESET_VOLTAGE_M      0x00300000
#define FCFG1_MISC_OTP_DATA_1_DBLR_LOOP_FILTER_RESET_VOLTAGE_S      20

// Field: [19:10] HPM_IBIAS_WAIT_CNT
//
// Trim value for [ANATOP_MMAP::DDI_0_OSC:RADCEXTCFG.HPM_IBIAS_WAIT_CNT].
#define FCFG1_MISC_OTP_DATA_1_HPM_IBIAS_WAIT_CNT_M                  0x000FFC00
#define FCFG1_MISC_OTP_DATA_1_HPM_IBIAS_WAIT_CNT_S                  10

// Field: [9:4] LPM_IBIAS_WAIT_CNT
//
// Trim value for [ANATOP_MMAP::DDI_0_OSC:RADCEXTCFG.LPM_IBIAS_WAIT_CNT].
#define FCFG1_MISC_OTP_DATA_1_LPM_IBIAS_WAIT_CNT_M                  0x000003F0
#define FCFG1_MISC_OTP_DATA_1_LPM_IBIAS_WAIT_CNT_S                  4

// Field: [3:0] IDAC_STEP
//
// Trim value for [ANATOP_MMAP::DDI_0_OSC:RADCEXTCFG.IDAC_STEP].
#define FCFG1_MISC_OTP_DATA_1_IDAC_STEP_M                           0x0000000F
#define FCFG1_MISC_OTP_DATA_1_IDAC_STEP_S                           0

//*****************************************************************************
//
// Register: FCFG1_O_PWD_CURR_20C
//
//*****************************************************************************
// Field: [31:24] DELTA_CACHE_REF
//
// Additional maximum current, in units of 1uA, with cache retention
#define FCFG1_PWD_CURR_20C_DELTA_CACHE_REF_M                        0xFF000000
#define FCFG1_PWD_CURR_20C_DELTA_CACHE_REF_S                        24

// Field: [23:16] DELTA_RFMEM_RET
//
// Additional maximum current, in 1uA units, with RF memory retention
#define FCFG1_PWD_CURR_20C_DELTA_RFMEM_RET_M                        0x00FF0000
#define FCFG1_PWD_CURR_20C_DELTA_RFMEM_RET_S                        16

// Field: [15:8] DELTA_XOSC_LPM
//
// Additional maximum current, in units of 1uA, with XOSC_HF on in low-power mode
#define FCFG1_PWD_CURR_20C_DELTA_XOSC_LPM_M                         0x0000FF00
#define FCFG1_PWD_CURR_20C_DELTA_XOSC_LPM_S                         8

